2019.08.06.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[http://alan.petitepomme.net/cwn/2019.07.30.html][Previous Week]] [[http://alan.petitepomme.net/cwn/index.html][Up]] [[http://alan.petitepomme.net/cwn/2019.08.13.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of July 30 to August 06, 2019.

#+TOC: headlines 1


* OCaml 4.08.1+rc3
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://sympa.inria.fr/sympa/arc/caml-list/2019-08/msg00004.html

** Florian Angeletti announced


The release of OCaml version 4.08.1 is expected for next week.

Before this happy event, we are releasing a third and last release
candidate.
This new release integrates two configuration fixes from Debian and Fedora
with the rc2 fixes for compilation failures in presence of "-pack"
reported by Fabian @copy (breaking nocrypto),
and dynlinking failures in bytecode mode reported by Andre Maroneze
(breaking Frama-C).

The source code is available at these addresses:

  https://github.com/ocaml/ocaml/archive/4.08.1+rc3.tar.gz \\
  https://caml.inria.fr/pub/distrib/ocaml-4.08/ocaml-4.08.1+rc3.tar.gz

The compiler can also be installed as an OPAM switch with one of the
following commands:

#+begin_example
opam switch create ocaml-variants.4.08.1+rc3 --repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
#+end_example

or

#+begin_example
opam switch create ocaml-variants.4.08.1+rc3+<VARIANT> --repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
#+end_example

where you replace <VARIANT> with one of these:
- afl
- default-unsafe-string
- force-safe-string
- flambda
- fp
- fp+flambda

We want to know about any bugs. Please report them here:
  https://github.com/ocaml/ocaml/issues

Happy hacking,
— Florian Angeletti, for the OCaml team.

*** OCaml 4.08.1 rc3:

**** Bug fixes:

- #7887: ensure frame table is 8-aligned on ARM64 and PPC64
   (Xavier Leroy, report by Mark Hayden, review by Mark Shinwell
    and Gabriel Scherer)

- #8751: fix bug that could result in misaligned data section when compiling to   native-code on amd64.  (observed with the mingw64 compiler)   (Nicolás Ojeda Bär, review by David Allsopp)

- #8769, #8770: Fix assertion failure with -pack
   (Leo White, review by Gabriel Scherer, report by Fabian @copy)

- #8816, #8818: fix loading of packed modules with Dynlink (regression in
   #2176).
   (Leo White, report by Andre Maroneze, review by Gabriel Scherer)

- #8830: configure script: fix tool prefix detection and Debian's armhf
   detection
   (Stéphane Glondu, review by David Allsopp)

- #8843, #8841: fix use of off_t on 32-bit systems.
   (Stephen Dolan, report by Richard Jones, review by Xavier Leroy)
      



* Ideal OCaml setups with VIM, Emacs, IntelliJ/IDEA?
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ideal-ocaml-setups-with-vim-emacs-intellij-idea/4037/6

** Deep in this thread, Anton Kochkov said


A small update: the OCaml and Dune runtime files landed in NeoVim as well, so you can already try them if you use it from git: https://github.com/neovim/neovim/commit/87140f234ac1f152f6f273dee5ab1e42c7b1d78b
      



* KV database (nosql) recommended for Mirage?
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/kv-database-nosql-recommended-for-mirage/4191/1

** Orbifx asked


Which KV database would you recommend for applications intended to build as Mirage Unikernels?
      

** Calascibetta Romain replied


Currently, when we need to make a KV-store with MirageOS, we use [[https://github.com/mirage/irmin][irmin]] as an high-level KV-store. Then, it provides some back-end like [[https://github.com/mirage/ocaml-git][git]]. A tutorial can be found [[https://zshipko.github.io/irmin-tutorial/Introduction.html][here]]. So, we currently prepare some releases of several packages around [[https://github.com/mirage/mirage/issues/994][MirageOS]] and [[https://github.com/mirage/irmin/issues/658][irmin]], so you currently need to ~pin~ some packages.

Example of how to use Irmin with Git backend and MirageOS can be found here:
- A static blog engine [[https://github.com/Engil/Canopy/pull/95#issuecomment-507755522][Canopy]]
- Some [[https://github.com/roburio/unikernels/][unikernels]] around DNS and iCalendar services
- A [[https://github.com/dinosaure/pasteur][_paste-bin_]] with [[https://github.com/inhabitedtype/httpaf/][httpaf]]
      

** Orbifx then asked


What about ~mirage-kv~ in opam?

I don't believe I need the overhead of the git store; can Irmin work without accumulating a history and any overhead of that?
      

** Calascibetta Romain replied


So ~mirage-kv~, as some others packages in Mirage, is just an interface. Then, you have some possibilities:
- make your own ~mirage-kv~ implementation (which can be a simple ~hashtbl~)
- use something like ~irmin~ which respects this interface

Then, it's mostly about what you want exactly. MirageOS does not have a proper file-system at the beginning and we use in some ways ~git~ to obtain persistence (where, when your unikernel will shutdown, you will lost contents). So, the idea is to have a KV-store inside the unikernel and a way to synchronize this KV-store with a remote repository - and, of course, we took the advantage of git, behind this idea (however, as I said, you can use/implement something else).

Then, with [[https://github.com/mirage/functoria][functoria]] you can easily orchestrate the compilation of your _unikernel_ to choose which will implement the ~mirage-kv~ signature.
      

** Orbifx then asked


Sorry I meant to ask what about ~mirage-kv-unix~. Is that with a git backend? Doesn't it have any history related overhead or is it a plain mutable RW backend?
      

** Hannes Mehnert replied


there's [[https://github.com/mirage/mirage-kv-mem][mirage-kv-mem]] which is not persistent, using a Map.t for storing data.

there's as well [[https://github.com/mirage/mirage-kv-unix][mirage-kv-unix]] which is only available on unix (i.e. not if you're running a freestanding unikernel), and uses the file system as persistent backing store.

both of them don't contain a history and are fine to use in certain programs! :)

(so, yes, mirage-kv-unix is persistent and without git)
      



* A library for Commitment Schemes
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/a-library-for-commitment-schemes/4208/1

** Marco Aurélio da Silva announced


Hi folks! Proudly I announce the stable version of a library for Commitment Schemes using an underlying/implemented AEAD (Authenticated Encryption with Associated Data) module. This library also uses a KDF (Key Derivation Function) package to make the implemented AEAD a Committing Encryption. Future plans might include user-level configuration of the KDF (for instance, the number of cycles) and also to split and expose the Committing Authenticated Encryption module into an external library.

All code of the Committing AEAD module was inspired on the paper _Message Franking via Committing Authenticated Encryption_. This 1.0.0 library can be installed with:

#+begin_example
opam install nocoiner
#+end_example

A command-line interface is also provided on the package. The Docker image with only this CLI interface can be installed with:

#+begin_example
docker pull marcoonroad/nocoiner
#+end_example

The executable is available at ~/usr/bin/nocoiner~ inside the image.

For the project documentation, please refer to:
https://nocoiner.marcoonroad.dev

PRs and issues are welcome. The repository is hosted at:
https://github.com/marcoonroad/nocoiner

Thanks in advance and happy hacking. o/
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[http://alan.petitepomme.net/cwn/][the archive]] or the [[http://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[http://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
