2019.08.06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-06 Tue 09:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2019.07.30.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2019.08.13.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of July 30 to August 06, 2019.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">OCaml 4.08.1+rc3</a></li>
<li><a href="#2">Ideal OCaml setups with VIM, Emacs, IntelliJ/IDEA?</a></li>
<li><a href="#3">KV database (nosql) recommended for Mirage?</a></li>
<li><a href="#4">A library for Commitment Schemes</a></li>
<li><a href="#org40b6d05">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-org649dcec" class="outline-2">
<h2 id="1">OCaml 4.08.1+rc3</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2019-08/msg00004.html">https://sympa.inria.fr/sympa/arc/caml-list/2019-08/msg00004.html</a>
</p>
</div>

<div id="outline-container-orgad66b10" class="outline-3">
<h3 id="orgad66b10">Florian Angeletti announced</h3>
<div class="outline-text-3" id="text-orgad66b10">
<p>
The release of OCaml version 4.08.1 is expected for next week.
</p>

<p>
Before this happy event, we are releasing a third and last release
candidate.
This new release integrates two configuration fixes from Debian and Fedora
with the rc2 fixes for compilation failures in presence of "-pack"
reported by Fabian @copy (breaking nocrypto),
and dynlinking failures in bytecode mode reported by Andre Maroneze
(breaking Frama-C).
</p>

<p>
The source code is available at these addresses:
</p>

<p>
 <a href="https://github.com/ocaml/ocaml/archive/4.08.1+rc3.tar.gz">https://github.com/ocaml/ocaml/archive/4.08.1+rc3.tar.gz</a> <br />
 <a href="https://caml.inria.fr/pub/distrib/ocaml-4.08/ocaml-4.08.1+rc3.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-4.08/ocaml-4.08.1+rc3.tar.gz</a>
</p>

<p>
The compiler can also be installed as an OPAM switch with one of the
following commands:
</p>

<pre class="example">
opam switch create ocaml-variants.4.08.1+rc3 --repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>

<p>
or
</p>

<pre class="example">
opam switch create ocaml-variants.4.08.1+rc3+&lt;VARIANT&gt; --repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>

<p>
where you replace &lt;VARIANT&gt; with one of these:
</p>
<ul class="org-ul">
<li>afl</li>
<li>default-unsafe-string</li>
<li>force-safe-string</li>
<li>flambda</li>
<li>fp</li>
<li>fp+flambda</li>
</ul>

<p>
We want to know about any bugs. Please report them here:
  <a href="https://github.com/ocaml/ocaml/issues">https://github.com/ocaml/ocaml/issues</a>
</p>

<p>
Happy hacking,
— Florian Angeletti, for the OCaml team.
</p>
</div>

<div id="outline-container-orge10e00b" class="outline-4">
<h4 id="orge10e00b">OCaml 4.08.1 rc3:</h4>
<div class="outline-text-4" id="text-orge10e00b">
</div>
<ul class="org-ul">
<li><a id="org4867340"></a>Bug fixes:<br />
<div class="outline-text-5" id="text-org4867340">
<ul class="org-ul">
<li>#7887: ensure frame table is 8-aligned on ARM64 and PPC64
  (Xavier Leroy, report by Mark Hayden, review by Mark Shinwell
   and Gabriel Scherer)</li>

<li>#8751: fix bug that could result in misaligned data section when compiling to   native-code on amd64.  (observed with the mingw64 compiler)   (Nicolás Ojeda Bär, review by David Allsopp)</li>

<li>#8769, #8770: Fix assertion failure with -pack
  (Leo White, review by Gabriel Scherer, report by Fabian @copy)</li>

<li>#8816, #8818: fix loading of packed modules with Dynlink (regression in
  #2176).
  (Leo White, report by Andre Maroneze, review by Gabriel Scherer)</li>

<li>#8830: configure script: fix tool prefix detection and Debian's armhf
  detection
  (Stéphane Glondu, review by David Allsopp)</li>

<li>#8843, #8841: fix use of off_t on 32-bit systems.
  (Stephen Dolan, report by Richard Jones, review by Xavier Leroy)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org9846b53" class="outline-2">
<h2 id="2">Ideal OCaml setups with VIM, Emacs, IntelliJ/IDEA?</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ideal-ocaml-setups-with-vim-emacs-intellij-idea/4037/6">https://discuss.ocaml.org/t/ideal-ocaml-setups-with-vim-emacs-intellij-idea/4037/6</a>
</p>
</div>

<div id="outline-container-org8d0f39f" class="outline-3">
<h3 id="org8d0f39f">Deep in this thread, Anton Kochkov said</h3>
<div class="outline-text-3" id="text-org8d0f39f">
<p>
A small update: the OCaml and Dune runtime files landed in NeoVim as well, so you can already try them if you use it from git: <a href="https://github.com/neovim/neovim/commit/87140f234ac1f152f6f273dee5ab1e42c7b1d78b">https://github.com/neovim/neovim/commit/87140f234ac1f152f6f273dee5ab1e42c7b1d78b</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org2e129f8" class="outline-2">
<h2 id="3">KV database (nosql) recommended for Mirage?</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/kv-database-nosql-recommended-for-mirage/4191/1">https://discuss.ocaml.org/t/kv-database-nosql-recommended-for-mirage/4191/1</a>
</p>
</div>

<div id="outline-container-org53d348a" class="outline-3">
<h3 id="org53d348a">Orbifx asked</h3>
<div class="outline-text-3" id="text-org53d348a">
<p>
Which KV database would you recommend for applications intended to build as Mirage Unikernels?
</p>
</div>
</div>


<div id="outline-container-org4795fea" class="outline-3">
<h3 id="org4795fea">Calascibetta Romain replied</h3>
<div class="outline-text-3" id="text-org4795fea">
<p>
Currently, when we need to make a KV-store with MirageOS, we use <a href="https://github.com/mirage/irmin">irmin</a> as an high-level KV-store. Then, it provides some back-end like <a href="https://github.com/mirage/ocaml-git">git</a>. A tutorial can be found <a href="https://zshipko.github.io/irmin-tutorial/Introduction.html">here</a>. So, we currently prepare some releases of several packages around <a href="https://github.com/mirage/mirage/issues/994">MirageOS</a> and <a href="https://github.com/mirage/irmin/issues/658">irmin</a>, so you currently need to <code>pin</code> some packages.
</p>

<p>
Example of how to use Irmin with Git backend and MirageOS can be found here:
</p>
<ul class="org-ul">
<li>A static blog engine <a href="https://github.com/Engil/Canopy/pull/95#issuecomment-507755522">Canopy</a></li>
<li>Some <a href="https://github.com/roburio/unikernels/">unikernels</a> around DNS and iCalendar services</li>
<li>A <a href="https://github.com/dinosaure/pasteur"><span class="underline">paste-bin</span></a> with <a href="https://github.com/inhabitedtype/httpaf/">httpaf</a></li>
</ul>
</div>
</div>


<div id="outline-container-org4214ee3" class="outline-3">
<h3 id="org4214ee3">Orbifx then asked</h3>
<div class="outline-text-3" id="text-org4214ee3">
<p>
What about <code>mirage-kv</code> in opam?
</p>

<p>
I don't believe I need the overhead of the git store; can Irmin work without accumulating a history and any overhead of that?
</p>
</div>
</div>


<div id="outline-container-orgc451035" class="outline-3">
<h3 id="orgc451035">Calascibetta Romain replied</h3>
<div class="outline-text-3" id="text-orgc451035">
<p>
So <code>mirage-kv</code>, as some others packages in Mirage, is just an interface. Then, you have some possibilities:
</p>
<ul class="org-ul">
<li>make your own <code>mirage-kv</code> implementation (which can be a simple <code>hashtbl</code>)</li>
<li>use something like <code>irmin</code> which respects this interface</li>
</ul>

<p>
Then, it's mostly about what you want exactly. MirageOS does not have a proper file-system at the beginning and we use in some ways <code>git</code> to obtain persistence (where, when your unikernel will shutdown, you will lost contents). So, the idea is to have a KV-store inside the unikernel and a way to synchronize this KV-store with a remote repository - and, of course, we took the advantage of git, behind this idea (however, as I said, you can use/implement something else).
</p>

<p>
Then, with <a href="https://github.com/mirage/functoria">functoria</a> you can easily orchestrate the compilation of your <span class="underline">unikernel</span> to choose which will implement the <code>mirage-kv</code> signature.
</p>
</div>
</div>


<div id="outline-container-org6165ccd" class="outline-3">
<h3 id="org6165ccd">Orbifx then asked</h3>
<div class="outline-text-3" id="text-org6165ccd">
<p>
Sorry I meant to ask what about <code>mirage-kv-unix</code>. Is that with a git backend? Doesn't it have any history related overhead or is it a plain mutable RW backend?
</p>
</div>
</div>


<div id="outline-container-orgc0243a9" class="outline-3">
<h3 id="orgc0243a9">Hannes Mehnert replied</h3>
<div class="outline-text-3" id="text-orgc0243a9">
<p>
there's <a href="https://github.com/mirage/mirage-kv-mem">mirage-kv-mem</a> which is not persistent, using a Map.t for storing data.
</p>

<p>
there's as well <a href="https://github.com/mirage/mirage-kv-unix">mirage-kv-unix</a> which is only available on unix (i.e. not if you're running a freestanding unikernel), and uses the file system as persistent backing store.
</p>

<p>
both of them don't contain a history and are fine to use in certain programs! :)
</p>

<p>
(so, yes, mirage-kv-unix is persistent and without git)
</p>
</div>
</div>
</div>




<div id="outline-container-orge3dc385" class="outline-2">
<h2 id="4">A library for Commitment Schemes</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/a-library-for-commitment-schemes/4208/1">https://discuss.ocaml.org/t/a-library-for-commitment-schemes/4208/1</a>
</p>
</div>

<div id="outline-container-orgd0d7153" class="outline-3">
<h3 id="orgd0d7153">Marco Aurélio da Silva announced</h3>
<div class="outline-text-3" id="text-orgd0d7153">
<p>
Hi folks! Proudly I announce the stable version of a library for Commitment Schemes using an underlying/implemented AEAD (Authenticated Encryption with Associated Data) module. This library also uses a KDF (Key Derivation Function) package to make the implemented AEAD a Committing Encryption. Future plans might include user-level configuration of the KDF (for instance, the number of cycles) and also to split and expose the Committing Authenticated Encryption module into an external library.
</p>

<p>
All code of the Committing AEAD module was inspired on the paper <span class="underline">Message Franking via Committing Authenticated Encryption</span>. This 1.0.0 library can be installed with:
</p>

<pre class="example">
opam install nocoiner
</pre>

<p>
A command-line interface is also provided on the package. The Docker image with only this CLI interface can be installed with:
</p>

<pre class="example">
docker pull marcoonroad/nocoiner
</pre>

<p>
The executable is available at <code>/usr/bin/nocoiner</code> inside the image.
</p>

<p>
For the project documentation, please refer to:
<a href="https://nocoiner.marcoonroad.dev">https://nocoiner.marcoonroad.dev</a>
</p>

<p>
PRs and issues are welcome. The repository is hosted at:
<a href="https://github.com/marcoonroad/nocoiner">https://github.com/marcoonroad/nocoiner</a>
</p>

<p>
Thanks in advance and happy hacking. o/
</p>
</div>
</div>
</div>




<div id="outline-container-org40b6d05" class="outline-2">
<h2 id="org40b6d05">Old CWN</h2>
<div class="outline-text-2" id="text-org40b6d05">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="http://alan.petitepomme.net/cwn/">the archive</a> or the <a href="http://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname">
<p>
<a href="http://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
